src/conf/Documents/уп_ПредварительнаяЗапись.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>уп_ПредварительнаяЗапись</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиПроцедур</xr:Item>
				<xr:Item>InformationRegister.уп_ГрафикРаботы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияНазначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/conf/InformationRegisters/уп_ГрафикРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>уп_ГрафикРаботы</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияНазначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/conf/AccumulationRegisters/ОстаткиПроцедур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиПроцедур</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияНазначений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/conf/Enums/уп_СостоянияНазначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>уп_СостоянияНазначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нераспределенная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматическая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ручная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержденная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неявка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/conf/Documents/уп_ПредварительнаяЗапись/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.Состояние = Перечисления.уп_СостоянияНазначений.Ручная;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//TODO: Продумать проверку заполнения для пар Кабинет и Процедура, Процедура и Сотрудник и т.д.
	
	//Если ТипЗаписи = Перечисления.ТипыПредварительнойЗаписи.ЗаписьКлиента Тогда
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидПрочейЗаписи"));		
	//Иначе		
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Клиент"));
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(Сотрудник) Тогда 
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Кабинет"));	
	//ИначеЕсли ЗначениеЗаполнено(Кабинет) Тогда 
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Сотрудник"));	
	//КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//TODO: Написать обработчик проведения документа
	
	// регистр уп_ГрафикРаботы
	Движения.уп_ГрафикРаботы.Записывать = Истина;
	Движение = Движения.уп_ГрафикРаботы.Добавить();
	Движение.Период 			= Дата;
	Движение.Сотрудник 			= Сотрудник;
	Движение.Клиент 			= Клиент;
	Движение.Помещение 			= Помещение;
	Движение.ВремяНачала 		= ВремяНачала;
	Движение.Назначение			= Назначение;	
	Движение.ВремяОкончания 	= ВремяОкончания;
	Движение.Состояние			= Состояние;
	
	Если ЗначениеЗаполнено(Клиент) И ЗначениеЗаполнено(Назначение) И (Состояние <> Перечисления.уп_СостоянияНазначений.Неявка) Тогда
		Движения.ОстаткиПроцедур.Записывать = Истина;
		Движение = Движения.ОстаткиПроцедур.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Процедура = Назначение;
		Движение.Период = Дата;
		Движение.Состояние = Состояние;
		Движение.Количество = 1;
		
		Движение = Движения.ОстаткиПроцедур.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Клиент = Клиент;
		Движение.Процедура = Назначение;
		Движение.Период = Дата;
		Движение.Состояние = Перечисления.уп_СостоянияНазначений.Нераспределенная;
		Движение.Количество = 1;
		
		Движения.ОстаткиПроцедур.Записать(Истина);
		
		Фильтр = Новый Структура("Клиент, Процедура, Состояние", Клиент, Назначение, Перечисления.уп_СостоянияНазначений.Нераспределенная);
				
		Остатки = РегистрыНакопления.ОстаткиПроцедур.Остатки(,Фильтр, ,"Количество");
		Если Остатки.Количество() > 0 Тогда
			Отказ = Остатки[0].Количество < 0;
		КонецЕсли;
		Если Не Отказ Тогда
			Граница = Новый Граница(Дата, ВидГраницы.Включая);
			Остатки = РегистрыНакопления.ОстаткиПроцедур.Остатки(Граница,Фильтр, ,"Количество");
			Если Остатки.Количество() > 0 Тогда
				Отказ = Остатки[0].Количество < 0;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Движения.ОстаткиПроцедур.Очистить();
		Движения.ОстаткиПроцедур.Записать();
	КонецЕсли;        

КонецПроцедуры

#КонецОбласти

#КонецЕсли
